app/controllers/comments_controller.rb

  def show
    @comment = Comment.find(params[:id])
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1

  def create
    @comment = current_user.comments.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO `comments` (`comment`, `created_at`, `product_id`, `updated_at`, `user_id`) VALUES ('test1', '2012-11-06 11:46:08', 58, '2012-11-06 11:46:08', 4)

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1