app/controllers/products_controller.rb

  def create
    @product = current_user.products.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`content`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `price`, `title`, `updated_at`, `user_id`) VALUES ('qwee', '2012-11-06 13:56:07', 'image/jpeg', '3D-Nature-Wallpapers-HD-2-150x150.jpg', 9887, '2012-11-06 13:56:07', 12, 'test image', '2012-11-06 13:56:07', 1)

  def destroy
    @product = current_user.products.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 AND `products`.`id` = 1 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1