app/views/products/_product.html.erb

    <p class="image"><%= image_tag product.image.url(:small) %>
      <span class="age">Posted at <%= time_ago_in_words(product.created_at) %> ago.
        <% if current_user %>
---
INSERT INTO `products` (`content`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `price`, `title`, `updated_at`, `user_id`) VALUES ('qwee', '2012-11-06 13:56:07', 'image/jpeg', '3D-Nature-Wallpapers-HD-2-150x150.jpg', 9887, '2012-11-06 13:56:07', 12, 'test image', '2012-11-06 13:56:07', 1)


      <% product.comments.each do |comm| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`product_id` = 58